openfoam_cases/xifoam_open/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;
#include "geomC"
vertices
(
    (0.0  -0.00 0.00) // 0  
    (0.3 -0.00 0.00) // 1
    (0.3 $W  0.00) // 2
    (0.0   $W 0.00) // 3
    (0.0   0.00  $H) // 4
    (0.3 -0.00  $H) // 5
    (0.3  $W   $H ) // 6
    (0.0   $W  $H) // 7/
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (300 $WC $HC) simpleGrading (1 1 1) // (170 50 50) +- ok, (170 80 80) - :D
);

edges
(
);

boundary
(
    // sym3
    // {
    //     type symmetryPlane;
    //     faces
    //     (
    //         (0 4 7 3)
    //     );
    // }
    top 
    {
        type patch;
        faces
        (
            (4 5 6 7) // top
        );
    }
    XL
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    border
    {
        type patch;
        faces
        (
            // (4 5 6 7) // top
            // (0 3 2 1)
            // (0 1 5 4)
            (7 6 2 3)

            // (0 4 7 3)
        );
    }
    border_0
    {
        type patch;
        faces
        (
            // (4 5 6 7) // top
            // (0 3 2 1)
            // (0 1 5 4)
            // (7 6 2 3)

            (0 4 7 3)
        );
    }
    border_liquid
    {
        type patch;
        faces
        (
            // (4 5 6 7)
            (0 3 2 1)
            //(0 1 5 4)
            // (7 6 2 3)
        );
    }
    sym2
    {
        type symmetryPlane;
        faces
        (
            // (4 5 6 7)
            //(0 3 2 1)
            (0 1 5 4)
            // (7 6 2 3)
        );
    }
    
);




// ************************************************************************* //
