openfoam_cases/xifoam_open/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


laminarFlameSpeed
{
    model           unstrained;

    unstrainedLaminarFlameSpeed
    {
        model           Gulder;

        // fuel            IsoOctane;
        fuel            Ethanol;

        Ethanol
        { 
            W               0.46949109232417996; 
            eta             -0.4423699808522842; 
            xi              5.93581288338703; 
            alpha           2.4448987792885952; 
            beta            -0.5734898748617275; 
            f               2.3; // Constant, see Gulders article for documentation 
        } 


        // equivalenceRatio 1;

        Methane
        {
            W               0.422;
            eta             0.15;
            xi              5.18;
            alpha           2;
            beta            -0.5;
            f               2.3;
        }

        Propane
        {
            W               0.446;
            eta             0.12;
            xi              4.95;
            alpha           1.77;
            beta            -0.2;
            f               2.3;
        }

        IsoOctane
        {
            W               0.4658;
            eta             -0.326;
            xi              4.48;
            alpha           1.56;
            beta            -0.22;
            f               2.3;
        }
    }
}

flameWrinkling
{
    model           uniformConstant;
    Xi 1;
}


// ************************************************************************* //
