openfoam_cases/xifoam_open/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heheuPsiThermo;
    mixture         inhomogeneousMixture;
    transport       sutherland;
    thermo          janaf;
    equationOfState perfectGas;
    specie          specie;
    energy          absoluteEnthalpy;
    // energy          absoluteInternalEnergy;
}

stoichiometricAirFuelMassRatio 9;


burntProducts 
{ 
    specie 
    { 
        molWeight       28.123408165747698; 
    } 
    thermodynamics 
    { 
        Tlow            200; 
        Thigh           2500.0; 
        Tcommon         1000.0; 
        highCpCoeffs 
        ( 
            3.0601916158146745 0.0019726983489292533 -6.950266851136399e-07 1.1606129667252638e-10
            -7.346784473836678e-15 -12134.566316257497 5.340250839440567
        ); 
        lowCpCoeffs 
        ( 
            3.3496502601283327 0.0016983933247784416 -2.4148666553670272e-06 3.1989348751368005e-09
            -1.3855350054862737e-12 -12208.672761311545 3.791887646831378
        ); 
    } 
    transport 
    { 
        As              1.6916519675441259e-06; 
        Ts              294.97943206450316; 
    } 
} 
fuel 
{ 
    specie 
    { 
        molWeight       46.069; 
    } 
    thermodynamics 
    { 
        Tlow            200; 
        Thigh           2500.0; 
        Tcommon         1000.0; 
        highCpCoeffs 
        ( 
            4.3471712 0.0186288 -6.779467e-06 8.165926e-10
            0.0 -30661.5743 3.24247304
        ); 
        lowCpCoeffs 
        ( 
            0.5765358 0.02894512 -1.61002e-05 3.591641e-09
            0.0 -29635.95 22.70813
        ); 
    } 
    transport 
    { 
        As              1.2261003106301657e-06; 
        Ts              516.6599072513797; 
    } 
} 
oxidant 
{ 
    specie 
    { 
        molWeight       28.850975843753762; 
    } 
    thermodynamics 
    { 
        Tlow            200; 
        Thigh           2500.0; 
        Tcommon         1000.0; 
        highCpCoeffs 
        ( 
            3.0014085479227264 0.0014869496432445201 -6.082850141992321e-07 1.2376456311196192e-10
            -9.887478559631058e-15 -957.6002690300617 5.8697512407728825
        ); 
        lowCpCoeffs 
        ( 
            3.4003114472958478 0.00048282441127764234 -1.0618477565383057e-06 2.422433196848277e-09
            -1.2497721654383667e-12 -1029.9426971000878 3.8888811095514986
        ); 
    } 
    transport 
    { 
        As              1.6530917175771994e-06; 
        Ts              204.09459719506998; 
    } 
} 

// fuel
// {
//     specie
//     {
//         molWeight       114.23;
//     }
//     thermodynamics
//     {
//         Tlow            298.15;
//         Thigh           5000;
//         Tcommon         1000;
//         highCpCoeffs    ( 19.3963 0.0488137 -1.55798e-05 2.17831e-09 -1.08391e-13 -37133.9 -78.8531 );
//         lowCpCoeffs     ( 0.429357 0.0765769 8.41306e-06 -5.86603e-08 2.79414e-11 -30446.4 25.6735 );
//     }
//     transport
//     {
//         As              1.67212e-06;
//         Ts              170.672;
//     }
// }

// oxidant
// {
//     specie
//     {
//         molWeight       28.8504;
//     }
//     thermodynamics
//     {
//         Tlow            200;
//         Thigh           6000;
//         Tcommon         1000;
//         highCpCoeffs    ( 3.10205 0.00123963 -4.17512e-07 6.60292e-11 -3.87448e-15 -985.517 5.35187 );
//         lowCpCoeffs     ( 3.58378 -0.0007269 1.66985e-06 -1.08452e-10 -4.31951e-13 -1050.53 3.11223 );
//     }
//     transport
//     {
//         As              1.67212e-06;
//         Ts              170.672;
//     }
// }

// burntProducts
// {
//     specie
//     {
//         molWeight       28.6068;
//     }
//     thermodynamics
//     {
//         Tlow            200;
//         Thigh           6000;
//         Tcommon         1000;
//         highCpCoeffs    ( 3.12468 0.00178578 -5.94695e-07 9.09801e-11 -5.1246e-15 -11005.8 5.03593 );
//         lowCpCoeffs     ( 3.47612 0.000758205 -3.68739e-07 1.3449e-09 -8.08868e-13 -11071.5 3.3058 );
//     }
//     transport
//     {
//         As              1.67212e-06;
//         Ts              170.672;
//     }
// }


// ************************************************************************* //
