openfoam_cases/xifoam_open/system/geomC
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
H               0.04;

W               0.005;

HC              57;

WC              7;

T               300;


// ************************************************************************* //
