openfoam_cases/xifoam_open/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    ignition;
        type    cellSet;
        action  new;
        source  sphereToCell;
        centre  (0.005 0.00 0.005);
        radius  0.0025;
    }

    {
        name    ignition;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     ignition;
    }
);

// ************************************************************************* //
